# 给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。

# 岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。

# 此外，你可以假设该网格的四条边均被水包围。

 

# 示例 1：

# 输入：grid = [
#   ['1','1','1','1','0'],
#   ['1','1','0','1','0'],
#   ['1','1','0','0','0'],
#   ['0','0','0','0','0']
# ]
# 输出：1
# 示例 2：

# 输入：grid = [
#   ['1','1','0','0','0'],
#   ['1','1','0','0','0'],
#   ['0','0','1','0','0'],
#   ['0','0','0','1','1']
# ]
# 输出：3 

class Solution:
    def numIslands(self, grid: List[List[str]]) -> int:
        m = len(grid)
        n =len(grid[0])

        def dfs(r,c):
            if r<0 or r>=m or c<0 or c>=n or grid[r][c] =="0":
                return
            grid[r][c] = "0"
            dfs(r-1,c)
            dfs(r+1,c)
            dfs(r,c-1)
            dfs(r,c+1)


        ans = 0
        for i in range(m):
            for j in range(n):
                if grid[i][j] == "1":
                    ans +=1
                    dfs(i,j)
        return ans 
    
# 记忆方法： 这题我用dfs做，我觉得这种递归的代码真的比广度优先搜索的容易写也容易背