# 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。

# 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。

# 问总共有多少条不同的路径？

# 示例 1：


# 输入：m = 3, n = 7
# 输出：28
# 示例 2：

# 输入：m = 3, n = 2
# 输出：3
# 解释：
# 从左上角开始，总共有 3 条路径可以到达右下角。
# 1. 向右 -> 向下 -> 向下
# 2. 向下 -> 向下 -> 向右
# 3. 向下 -> 向右 -> 向下
# 示例 3：

# 输入：m = 7, n = 3
# 输出：28
# 示例 4：

# 输入：m = 3, n = 3
# 输出：6


class Solution:
    def uniquePaths(self, m: int, n: int) -> int:
        dp = [[1]*n for _ in range(m)]
        for i in range(1,m):
            for j in range(1,n):
                dp[i][j] = dp[i-1][j] + dp[i][j-1]
        return dp[m-1][n-1]

# 记忆方法：注意从第二行第二列开始，因为第一行第一列都是一种所以初始dp为1,像杨辉三角。
# 我觉得要和那个有路障的63题联合记忆，那个你初始要为0且要讨论一下。
